---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.ArcAlignmentRegenFailed
source: html/9448af26-18d3-b83c-1460-6a0588727045.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.ArcAlignmentRegenFailed Property

Can't form arc alignment.

## Syntax (C#)
```csharp
public static FailureDefinitionId ArcAlignmentRegenFailed { get; }
```